{
  "traverseCity": {
    "tent": {
      "timberRidge": {
        "title": "Timber Ridge Recreation",
        "content": "Nestled near Lake Michigan at the base of the east arm of Grand Traverse Bay, Timber Ridge RV & Recreation Resort boasts a charming location bordering Pere Marquette State Forest. With eight basic cabins, 10 deluxe cabins, and 15 full-service cottages, it's an ideal year-round haven for weekend getaways, family reunions, or retirement parties. In summer, revel in the swimming pool, nature trails, playground, family activities, and more. Winter brings heated cabins, cross-country ski rentals, access to a lodge and kitchen, and direct entry to groomed snowmobile trails. Just 10 minutes from downtown Traverse City, this peaceful retreat offers over 200 clean campsites, resort-quality facilities, and additional perks like barbecue grills, a camp store, and laundry facilities.",
        "available": false,
        "price": 0,
        "name": "",
        "taxRate": 0.11,
        "message": "Unavailable"
      },
      "leelanauPines": {
        "title": "Leelanau Pines Campground",
        "content": "Description",
        "available": false,
        "price": 0,
        "name": "",
        "taxRate": 0.06,
        "message": "Unavailable"
      }
    },
    "lodging": {}
  },
  "mackinacCity": {
    "tent": {
      "indianRiver": {
        "title": "Indian River RV Resort",
        "content": "Indian River RV Resort is a family-owned and operated campground located on the eastern shore of Indian River, Michigan. The campground offers a peaceful and scenic setting, with a mix of wooded and waterfront campsites. It features a sandy beach, a playground, and a picnic area. The campground also offers a general store, a laundromat, and a dump station. Indian River RV Resort is a great destination for those looking to enjoy the natural beauty of northern Michigan while still having access to nearby amenities.",
        "available": false,
        "price": 0,
        "name": "",
        "taxRate": 0,
        "message": "Unavailable"  
      }
    },
    "lodging": {}
  },
  "picturedRocks": {
    "tent": {
      "uncleDucky": {
        "title": "Uncle Ducky's - Paddlers Village",
        "content": "Paddlers Village offers a modern camping experience with electricity in every unit, mini fridges, and direct access to amenities like the Duck Pond Eatery and Grand Island Boat Cruise dock. The smaller private beach adds waterfront charm. In contrast, Au Train Beach Campground is larger, embracing a rustic feel with solar-powered lights and USB ports for most units. Only Grand Yurts and Common Areas have wired electricity. Despite lacking on-site beach access, it compensates with proximity to the expansive 3-mile-long Au Train Beach, providing a natural and spacious setting with the option to have fires. The choice boils down to preferences for modern conveniences and smaller beaches (Paddlers Village) versus a larger, rustic ambiance and access to a significant natural beach (Au Train Beach Campground).",
        "available": false,
        "name": "",
        "price": 0,
        "taxRate": 0.07,
        "message": "Unavailable",
        "partialPayment": true,
        "disclaimer": "* Disclaimer: Only 50% of the total payment is required at the time of booking, the remaining 50% will be due later. You will receive an email from Uncle Duckys with further information upon successful payment."
      },
      "touristPark": {
        "title": "Tourist Park Campground",
        "content": "Description",
        "available": false,
        "price": 0,
        "name": "",
        "taxRate": 0.03,
        "message": "Unavailable"
      },
      "fortSuperior": {
        "title": "Fort Superior Campground",
        "content": "Description",
        "available": false,
        "price": 0,
        "name": "",
        "taxRate": 0.05,
        "message": "Unavailable"
      }
    },
    "lodging": {}
  }
}
